aaron-bond.better-comments
adpyke.codesnap
agenciae-plus.vtexio-intellisense
alefragnani.bookmarks
anthropic.claude-code
anysphere.remote-containers
ashrafhadden.dracula-dot-min
atlassian.atlascode
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
codium.codium
cweijan.vscode-office
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
denoland.vscode-deno
dracula-theme.theme-dracula
drcika.apc-extension
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
equimper.react-native-react-redux
esbenp.prettier-vscode
figma.figma-vscode-extension
github.vscode-github-actions
graphql.vscode-graphql
graphql.vscode-graphql-syntax
incognita.deco-cx
jdinhlife.gruvbox
jock.svg
lllllllqw.jsdoc
louiswt.regexp-preview
maurodesouza.vscode-simple-readme
meganrogge.template-string-converter
mhutchie.git-graph
miguelsolorio.symbols
milaniromulo.vtex-whoami
mintlify.document
ms-ceintl.vscode-language-pack-pt-br
ms-edgedevtools.vscode-edge-devtools
ms-vscode.powershell
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
msjsdiag.vscode-react-native
mtxr.sqltools
n3rds-inc.pomodoro-timer-focus
naumovs.color-highlight
oderwat.indent-rainbow
openai.chatgpt
orta.vscode-jest
otovo-oss.htmx-tags
pkief.material-icon-theme
prisma.prisma
qwtel.sqlite-viewer
rangav.vscode-thunder-client
redhat.vscode-xml
redhat.vscode-yaml
ricardo-emerson.create-react-tsx-component
ricardo-emerson.react-development-extensions-pack
ritwickdey.liveserver
rocketseat.rocketseatreactjs
rocketseat.rocketseatreactnative
rvest.vs-code-prettier-eslint
sainoba.px-to-rem
shan.code-settings-sync
styled-components.vscode-styled-components
stylelint.vscode-stylelint
thomasviaud.tachyons-snippets
tobermory.es6-string-html
tonybaloney.vscode-pets
vespa-dev-works.jestrunit
vsls-contrib.gistfs
wakatime.vscode-wakatime
wesley-fernandes.htmx-intellisensce
yoavbls.pretty-ts-errors
